// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя)/

int number = 5;

int result = number * number;

Console.WriteLine(result);